import random

l = []
for i in range(35):
    l.append(random.randint(1, 100))

print("Список з випадковими значеннями:")
print(l)

p = l[1] * l[-2]
print("Добуток другого та передостаннього значення:", p)

l[0], l[1] = l[1], l[0]
print("Список після обміну першого та другого елементів:")
print(l)

l[-1], l[-2] = l[-2], l[-1]
print("Список після обміну останнього та передостаннього елементів:")
print(l)

s1 = sum(l[:4])
s2 = sum(l[-4:])
print("Сума перших 4 елементів:", s1)
print("Сума останніх 4 елементів:", s2)

s3 = sum(l[2::3])
print("Сума кожного третього елемента:", s3)
